let celsius = prompt('Введите температуру в градусах');
let fahrenheit = ((9	/	5)	* celsius	+	32);
alert(fahrenheit);


let name = "Василий";
let admin = name;
alert(admin);


let a = 10	+	10	+	"10" //	2010, сложение двух числе и далее конкатенациия 
let a = 10	+	"10"	+	10 //	конкатенация, все числа привелись к строкам и "склеились"
let a = 10	+	10	+ + "10"	// 30, приведение последнего значения "10" к числу и сложение с другими числами
let a = 10	/	-""	// -Infinity, тип Number, отрицательная бесконечность в результате деления
let a = 10	/	+"2,5" //	NaN, невозможно число разделить на строку


let	mode	=	"normal";	// корректно
let	my_valu3	=	102;	// корректно
let	3my_value3	=	"102";	// не корректно, нельзя начинать с числа
let	__hello__	=	"world";	// корректно
let	$$$	=	"money";	// в принципе корректно, но не красиво )
let	!0_world	=	true; // не корректно, нельзя начинать с символа кроме $ и _